# -*- coding: utf-8 -*-
"""
-------------------------------------------------
   File Name:     实例001_数字组合
   Description :
   Author :       a
   date:          2020/5/18
-------------------------------------------------

题目：
    有四个数字：1、2、3、4，能组成多少个互不相同且无重复数字的三位数？各是多少？
    程序分析 遍历全部可能，把有重复的剃掉
"""


num = 0
for i in range(1,5):
    for j in range(1,5):
        for k in range(1, 5):
            if (i != j) and (i != k) and (j != k):
                print("%d%d%d" % (i, j, k))
                num += 1
print("总共有%d个无重复的三位数" % num)