# -*- coding: utf-8 -*-
"""
-------------------------------------------------
   File Name:     实例011_养兔子
   Description :
   Author :       a
   date:          2020/5/27
-------------------------------------------------

题目：
    有一对兔子，从出生后第3个月起每个月都生一对兔子，
    小兔子长到第三个月后每个月又生一对兔子，假如兔子都不死，
    问每个月的兔子总数为多少？

分析：

"""

# 按个数统计
def fun(n):
    a = 2
    t = 0
    s = 0
    r = 0
    for i in range(0,n):
        if i < 2:
            s = a
            r = s
        else:
            s = r
            r = s + t
            if (i % 6) == 0 :
                print("\n")
        t = s
        print("%8d" % r, end="")



fun(16)

print("\n#######################################################")
# 按对数统计
def fun2(n):
    f1 = 1
    f2 = 1
    for i in range(1, n+1):
        print("%8d%8d" % (f1, f2), end="")
        if (i % 3) == 0:
            print("\n")
        f1 = f1 + f2
        f2 = f1 + f2

fun2(8)